import json

# 创建一个包含多组指令的列表
instruction_queue = [
    [
        {'执行者': '移动机器人', '任务类别': '移动', '任务内容': {'x': -1.170713179748654, 'y': 0.04374214671541992, 'yaw': -2.255652161020206, 'z': 0.0}},
        {'执行者': '移动机器人', '任务类别': '发音', '任务内容': '我已到达目的地。'},
        {'执行者': '机械臂', '任务类别': '机械臂动作', '任务内容': ['reach', 'chabao', 'catch', 'put', 'cup', 'release']},
        {'执行者': '机械臂', '任务类别': '机械臂动作', '任务内容': ['reach', 'cup', 'catch']},
        {'执行者': '机械臂', '任务类别': '机械臂动作', '任务内容': ['put', 'tuopan', 'release']},
        {'执行者': '移动机器人', '任务类别': '移动', '任务内容': {'x': -1.170713179748654, 'y': 0.04374214671541992, 'yaw': -2.255652161020206, 'z': 0.0}}
    ],
    [
        {'执行者': '移动机器人', '任务类别': '移动', '任务内容': {'x': -1.170713179748654, 'y': 0.04374214671541992, 'yaw': -2.255652161020206, 'z': 0.0}},
        {'执行者': '移动机器人', '任务类别': '发音', '任务内容': '我已到达目的地。'},
        {'执行者': '机械臂', '任务类别': '机械臂动作', '任务内容': ['reach', 'chabao', 'catch', 'put', 'cup', 'release']},
        {'执行者': '机械臂', '任务类别': '机械臂动作', '任务内容': ['reach', 'cup', 'catch']},
        {'执行者': '移动机器人', '任务类别': '移动', '任务内容': {'x': -1.170713179748654, 'y': 0.04374214671541992, 'yaw': -2.255652161020206, 'z': 0.0}}
    ]
]

# 将指令队列转换为JSON字符串
instruction_queue_json = json.dumps(instruction_queue)

# 将JSON字符串发送给接收端
print(instruction_queue_json)

# 解析JSON字符串并还原成原本的指令队列
received_instruction_queue = json.loads(instruction_queue_json)

# 打印接收到的指令队列
print(received_instruction_queue)